FemDesign.Shells.EdgeConnection
ec_type

FemDesign.Shells.EdgeConnection.Release


FemDesign.Shells.EdgeConnection.LibraryName
Library name of the edge connection.

FemDesign.Shells.EdgeConnection.IsLibraryItem
Should the edge connection be added to the model as a Predefined/Library item or not?

FemDesign.Shells.EdgeConnection.IsCustomItem
Edge connection is a custom item if it is not in the library (predefined line connections library).

FemDesign.Shells.EdgeConnection.#ctor
Parameterless constructor for serialization.

FemDesign.Shells.EdgeConnection.#ctor(FemDesign.Releases.RigidityDataType3,System.String)
Private constructor.

FemDesign.Shells.EdgeConnection.CopyExisting(FemDesign.Shells.EdgeConnection,System.String)
Copy properties from a EdgeConnection with a new name.

FemDesign.Shells.EdgeConnection.#ctor(FemDesign.Releases.Motions,FemDesign.Releases.Rotations,System.String)
EdgeConnection
Remarks: Create
motions: Motions.
rotations: Rotations.
libraryName: When libraryName is not null or empty, the FemDesign.Shells.EdgeConnection will be treated as a predefined/library item. Default is to treat is a a unique custom edge connection.

FemDesign.Shells.EdgeConnection.#ctor(FemDesign.Releases.Motions,FemDesign.Releases.MotionsPlasticLimits,FemDesign.Releases.Rotations,FemDesign.Releases.RotationsPlasticLimits,System.String)
EdgeConnection
Remarks: Create
motions: Motions.
motionsPlasticLimits: Motions plastic limit forces
rotations: Rotations.
rotationsPlasticLimits: Rotations plastic limit forces
libraryName: When libraryName is not null or empty, the FemDesign.Shells.EdgeConnection will be treated as a predefined/library item. Default is to treat is a a unique custom edge connection.

FemDesign.Shells.EdgeConnection.Default
Create a default (rigid) EdgeConnection.

FemDesign.Shells.EdgeConnection.Hinged
Create a hinged EdgeConnection.
Remarks: Create
Returns:

FemDesign.Shells.EdgeConnection.Rigid
Create a rigid EdgeConnection.
Remarks: Create
Returns: